{
  "supermarket": [
    {
      "id": 1,
      "itemname": "Vegetables",
      "price": 500,
      "quantity": "5",
      "instock": "50"
    },
    {
      "id": 2,
      "itemname": "Rice",
      "price": 1500,
      "quantity": "20",
      "instock": "20"
    },
    {
      "id": 3,
      "itemname": "Regular Oil ",
      "price": 800,
      "quantity": "2",
      "instock": "100"
    },
    {
      "id": 4,
      "itemname": "Milk",
      "price": 100,
      "quantity": "4",
      "instock": "400"
    },
    {
      "itemname": "Bread",
      "price": "450",
      "quantity": "5",
      "instock": "150",
      "id": 5
    },
    {
      "itemname": "Orange",
      "price": "250",
      "quantity": "5",
      "instock": "500",
      "id": 6
    },
    {
      "itemname": "Ice-cream",
      "price": "175",
      "quantity": "1",
      "instock": "5",
      "id": 7
    },
    {
      "itemname": "Chocolate",
      "price": "500",
      "quantity": "30",
      "instock": "50",
      "id": 8
    },
    {
      "itemname": "Dark Chocolate",
      "price": "450",
      "quantity": "20",
      "instock": "90",
      "id": 9
    },
    {
      "itemname": "Full Cream Milk",
      "price": "50",
      "quantity": "8",
      "instock": "100",
      "id": 3
    },
    {
      "itemname": "Tond Milk",
      "price": "23",
      "quantity": "44",
      "instock": "50",
      "id": 11
    },
    {
      "itemname": "Olive Oil",
      "price": "800",
      "quantity": "15",
      "instock": "8",
      "id": 12
    },
    {
      "itemname": "Paneer",
      "price": "500",
      "quantity": "3",
      "instock": "Yes",
      "id": 13
    }
  ],
  "slickImg": [
    {
      "title": "Direct from farm",
      "photo": "/img/slider/img1.jpg"
    },
    {
      "title": "Great Items",
      "photo": "/img/slider/img1.jpg"
    },
    {
      "title": "Always Fresh",
      "photo": "/img/slider/img1.jpg"
    }
  ],
  "about": [
    {
      "title": "Features of a Super Market",
      "displaytext": "A large retailing business unit, selling mainly food and groceries on the basis of the low marginal gain. It has a wide variety and varied assortment of goods. It lays emphasis on self service.  A supermarket is a large retailing shop where goods are displayed in such a way that buyers select products for themselves. Buyers collect their product off the shelves invariably in a trolley and get them billed by the counter clerk and Laptop."
    },
    {
      "title": "Advantages of Super Market",
      "displaytext": "Prices are comparatively lower. Supermarkets are located in busy centres. Buyers get quality goods at lower prices. Profit margin is lower, Customers get a wide assortment of goods, Shopping is convenient. There is no risk of bad debts."
    }
  ],
  "homepage": [
    {
      "hometitle": "A Great Super Market ",
      "photo": "../img/slider/img1.jpg",
      "hometext": "Quickly design and customize responsive mobile-first sites with Bootstrap, the world most popular front-end open source toolkit, featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins. featuring Sass variables and mixins, responsive grid system, extensive prebuilt component."
    },
    {
      "hometitle": "Best Service Offer...",
      "photo": "../img/slider/img2.jpg",
      "hometext": "Quickly design and customize responsive mobile-first sites with Bootstrap, the world most popular front-end open source toolkit, featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins. featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins.Quickly design and customize responsive mobile-first sites with Bootstrap, the world most popular front-end open source toolkit, featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins."
    }
  ],
  "interviewQuestions": [
    {
      "questionTitle": "What is ReactJS?",
      "questionAnswer": "This is one of the first ReactJS interview questions. You need to be able to explain that React is a JavaScript-based UI library. It was developed at Facebook with the purpose of creating interactive and reusable UI components.  React is currently one of the most popular JavaScript framework used for handling the presentation layer for the web and mobile apps.",
      "qImg": ""
    },
    {
      "questionTitle": "Name some advantages of React.",
      "questionAnswer": "High efficiency: React is known for its flexibility and efficiency because of its own virtual DOM that it creates. It automatically calculates the changes needed to be made in DOM thus avoiding expensive DOM options and making regular updates whenever needed. Easier JavaScript writing: Thanks to the JSX syntax which allows you to mix HTML with JavaScript, writing is much easier with React. The user can simply drop a bit of HTML in the render function without having to concatenate strings and React then turns those HTML bits into functions with its JSXTransformer.  A variety of developer tools: in order to get the most out of React.js, you should install its official browser extension. It comes in quite handy, especially for debugging the app. It gives you a direct look into the virtual DOM as if you were browsing a regular DOM tree in the elements panel.  Great for SEO: Most of the JavaScript frameworks are not particularly search engine friendly, but that is not the case with React. Thanks to its unique virtual DOM that is rendered to the browser as a regular page, the search engines will not encounter the same issues as with reading other JavaScript-heavy apps.  UI Test Cases: It is very easy to write UI test cases thanks to the virtual DOM in JavaScript.",
      "qImg": ""
    },
    {
      "questionTitle": "Controlled and uncontrolled components",
      "questionAnswer": "When we talk about Controlled and Uncontrolled Components, it is  always referring to components which are handling forms or form inputs in them. // In a controlled component, form data is handled by a React component. Whereas in uncontrolled components, form data is handled by the DOM itself. // Usage of Component State is a must for controlled components. Use of state is completely optional for uncontrolled components, but one must use Refs in it.//With controlled components, we can validate as the input is being changed but the same is not possible with uncontrolled components.",
      "qImg": "../img/question/control.jpg"
    },
    {
      "questionTitle": "What is JSX?",
      "questionAnswer": "JSX is an XML/HTML-like syntax used by React for extending ECMAScript in order for the XML/HTML-like text to coexist with JavaScript/React code. The syntax is intended to be used by preprocessors (i.e., transpilers like Babel) to transform HTML-like text found in JavaScript files into standard JavaScript objects that a JavaScript engine will parse.",
      "qImg": ""
    },
    {
      "questionTitle": "What is the difference between createElement and cloneElement?",
      "questionAnswer": "This is one of the quite logical React interview questions and answers. Basically, as the name suggests, createElement what React uses to create React Elements, cloneElement, on the other hand, is used to clone an element and pass it new props. Might seem quite obvious, but it is still one of the top 50 interview questions and answers.",
      "qImg": ""
    },
    {
      "questionTitle": "What is the difference between state and props?",
      "questionAnswer": "In a React component, props are variables passed to it by its parent component. State on the other hand is still variables, but directly initialized and managed by the component.",
      "qImg": ""
    },
    {
      "questionTitle": "What is Redux?",
      "questionAnswer": "The basic idea of Redux is that the entire application state is kept in a single store which is simply a JavaScript object. If you want to change the state, you need to fire actions from your application and then write reducers for these actions that modify the state. The entire state transition is kept inside reducers and isn’t supposed to have any side effects.",
      "qImg": ""
    },
    {
      "questionTitle": "What is the difference between React Native and React?",
      "questionAnswer": "React is a JavaScript library and it supports both front-end web and being run on the server and it is commonly used for building user interfaces and web applications.  React Native, however, is a mobile framework that compiles to native app components. It allows us to build native mobile applications for Windows, Android, and iOS in JavaScript while we can use ReactJS to build our components.",
      "qImg": ""
    },
    {
      "questionTitle": "What are refs in React? When to use them?",
      "questionAnswer": "Refs are used for storing the reference of element or component returned by the component render() configuration function. In most cases, they should be avoided although there are some instances when using them is useful, such as: Managing focus, text selection, or media playback.",
      "qImg": ""
    },
    {
      "questionTitle": "What is the difference between DOM and virtual DOM in React.js?",
      "questionAnswer": "DOM aka Document Object Model is an abstraction of structured code (HTML). Dom and HTML code are interrelated as the elements of HTML are known as nodes of DOM. It defines a structure where users modify the content present in the structure in any way they want (create, edit, alter, modify etc.). Basically, HTML is a text, DOM is an in-memory representation of this text.  Virtual DOM is a representation of DOM objects like a lightweight copy. It is used and provided for free by React.js",
      "qImg": ""
    }
  ]
}